eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
#if defined(MICA_SECURITY_PROFILE_RELEASE)
constexpr const char* kSecurityProfile = "release";
#else
constexpr const char* kSecurityProfile = "dev";
#endif

Preferences gPrefs;
WebSocketsClient gWs;
WiFiClient gMqttNetClient;
PubSubClient gMqtt(gMqttNetClient);
String gServerHost;
uint16_t gServerPort = 5272;
String gMqttHost;
uint16_t gMqttPort = kDefaultMqttPort;
String gMqttRootTopic = kDefaultMqttRootTopic;
String gDeviceId;
String gToken;
String gActiveAppId;
String gActiveAppName;
String gActiveAppConfig;
portMUX_TYPE gStreamBufferMux = portMUX_INITIALIZER_UNLOCKED;
uint8_t gBinsBuffers[2][kBinsCount] = {};
uint8_t gBinsActiveIndex = 0;
uint8_t gLevel = 0;
uint8_t gStreamBrightness = 255;
uint8_t gBrightnessCap = kBrightnessDefaultCap;
uint16_t gFrameRgb565Buffers[2][kMatrixPixelCount] = {};
uint8_t gFrameRgb565ActiveIndex = 0;
unsigned long gLastFrameMs = 0;
unsigned long gWsDisconnectedSinceMs = 0;
unsigned long gMqttDisconnectedSinceMs = 0;
unsigned long gWifiDisconnectedSinceMs = 0;
unsigned long gLastTelemetryMs = 0;
unsigned long gTestLedUntilMs = 0;
unsigned long gTestLedNextToggleMs = 0;
bool gTestLedState = false;
bool gTestLedEnabled = false;
bool gTestLedPwmReady = false;
bool gAuxLedAvailable = false;
bool gOnboardTestLedAvailable = false;
uint8_t gTestLedDuty = 0;
uint8_t gTestLedPulseDuty = 0;
bool gMatrixReady = false;
bool gMatrixFrameDirty = false;
bool gPendingMatrixPresentCountsAsApplied = false;
bool gMatrixSignalTimedOut = false;
uint8_t gAppliedBrightness = 255;
bool gFrameModeActive = false;
uint32_t gLastMatrixPresentUs = 0;
uint32_t gHub75PresentFrames = 0;
unsigned long gLoopWindowStartMs = 0;
uint32_t gLoopWindowIterationCount = 0;
uint32_t gLoopWindowHealthyCount = 0;
uint8_t gLoopHealthyPercent = 0;
bool gLoopHealthyPercentReady = false;
uint32_t gTelemetrySequence = 0;
uint32_t gDeviceLogSequence = 0;
bool gHasStreamLastSequence = false;
uint32_t gStreamLastSequence = 0;
uint32_t gStreamFramesReceived = 0;
uint32_t gStreamFramesApplied = 0;
uint32_t gStreamSequenceGapCount = 0;
uint32_t gStreamInvalidFrameCount = 0;
uint32_t gNetworkPollDeferCount = 0;
bool gProvisioningPortalActive = false;
String gWifiState = kWifiStateConnecting;
String gLastWifiEvent = "boot";
String gAuxLedUnavailableReason;
String gSerialInputBuffer;
unsigned long gLastSerialHelloMs = 0;
unsigned long gWsFlapWindowStartMs = 0;
uint16_t gWsConnectCountInWindow = 0;
uint16_t gWsDisconnectCountInWindow = 0;
String gPendingOtaCommandId;
String gPendingOtaSourceVersion;
String gPendingOtaTargetVersion;
String gPendingOtaFailureCode;
String gPendingOtaFailureMessage;
unsigned long gPendingOtaValidationStartedMs = 0;
bool gPendingOtaPendingVerifyAnnounced = false;
uint8_t gRgb5To8Lut[32] = {0};
uint8_t gRgb6To8Lut[64] = {0};
uint16_t gMatrixShadowFrames[kMatrixShadowBufferCount][kMatrixPixelCount] = {};
uint8_t gMatrixShadowBarHeights[kMatrixShadowBufferCount][kMatrixWidth] = {};
MatrixBufferMode gMatrixBufferModes[kMatrixShadowBufferCount] = {
    MatrixBufferMode::Unknown,
    MatrixBufferMode::Unknown};
uint8_t gMatrixShadowBackBufferIndex = 0;

enum class PendingOtaBootState : uint8_t {
  None = 0,
  PendingVerify = 1,
  ValidatedPendingReport = 2,
  RolledBackPendingReport = 3,
  FailedPendingReport = 4,
};

PendingOtaBootState gPendingOtaBootState = PendingOtaBootState::None;

struct FirmwareReleaseInfo;

void connectWebSocket();
void connectMqtt();
void handleControlCommandMessage(const JsonDocument& control);
void sendCommandProgress(
    const String& commandId,
    uint8_t progressPercent,
    const char* stage,
    const String& message,
    int successFlag = -1);
bool hasPendingOtaContext();
bool tryGetRunningOtaState(esp_ota_img_states_t& otaState);
bool isRunningAppPendingVerify();
void loadPendingOtaContext();
void clearPendingOtaContext();
bool persistPendingOtaContext(const String& commandId, const String& sourceVersion, const String& targetVersion);
void initializePendingOtaBootState();
void processPendingOtaSafeUpdate();
void publishPendingOtaReportIfNeeded();
void requestPendingOtaRollbackAndReboot(const char* errorCode, const String& errorMessage);
bool tryFetchLatestFirmwareRelease(FirmwareReleaseInfo& info, const String& requestedVersion, String& errorCode, String& errorMessage);
bool performFirmwareOta(const FirmwareReleaseInfo& info, const String& commandId, String& errorCode, String& errorMessage);

#if defined(MICA_PROFILE_DMA_EXP)
MatrixPanel_I2S_DMA* gMatrix = nullptr;
constexpr HUB75_I2S_CFG::shift_driver kHub75BaselineDriver = HUB75_I2S_CFG::SHIFTREG;
#endif

struct RgbColor {
  uint8_t r;
  uint8_t g;
  uint8_t b;
};

struct FirmwareReleaseInfo {
  String firmwareVersion;
  String boardModel;
  String panelType;
  String profile;
  String controlPlane;
  String sha256;
  uint32_t fileSizeBytes = 0;
  String downloadPath;
};

constexpr uint32_t ceilDivideU32(uint32_t numerator, uint32_t denominator) {
  return denominator == 0 ? 0u : (numerator + denominator - 1u) / denominator;
}

size_t matrixPixelIndex(uint8_t x, uint8_t y) {
  return static_cast<size_t>(y) * static_cast<size_t>(kMatrixWidth) + static_cast<size_t>(x);
}

uint16_t rgb888ToRgb565(uint8_t r, uint8_t g, uint8_t b) {
  return static_cast<uint16_t>(((r & 0xF8u) << 8) | ((g & 0xFCu) << 3) | (b >> 3));
}

void initializeColorConversionLookups() {
  for (uint8_t value = 0; value < 32; value++) {
    gRgb5To8Lut[value] = static_cast<uint8_t>((static_cast<uint16_t>(value) * 255u + 15u) / 31u);
  }

  for (uint8_t value = 0; value < 64; value++) {
    gRgb6To8Lut[value] = static_cast<uint8_t>((static_cast<uint16_t>(value) * 255u + 31u) / 63u);
  }
}

void clearMatrixShadowBuffer(uint8_t bufferIndex) {
  if (bufferIndex >= kMatrixShadowBufferCount) {
    return;
  }

  memset(gMatrixShadowFrames[bufferIndex], 0, sizeof(gMatrixShadowFrames[bufferIndex]));
  memset(gMatrixShadowBarHeights[bufferIndex], 0, sizeof(gMatrixShadowBarHeights[bufferIndex]));
  gMatrixBufferModes[bufferIndex] = MatrixBufferMode::Clear;
}

void resetMatrixShadowState() {
  for (uint8_t bufferIndex = 0; bufferIndex < kMatrixShadowBufferCount; bufferIndex++) {
    clearMatrixShadowBuffer(bufferIndex);
  }

  gMatrixShadowBackBufferIndex = 0;
}

void setMatrixShadowPixel(uint8_t x, uint8_t y, uint16_t rgb565) {
  if (x >= kMatrixWidth || y >= kMatrixHeight) {
    return;
  }

  gMatrixShadowFrames[gMatrixShadowBackBufferIndex][matrixPixelIndex(x, y)] = rgb565;
}

