eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
  ledcWrite(kTestLedPwmChannel, duty);
}

void applyOnboardTestLedDuty(uint8_t duty) {
  if (!gOnboardTestLedAvailable) {
    return;
  }

#if defined(RGB_BUILTIN) || defined(PIN_NEOPIXEL)
  neopixelWrite(kOnboardTestLedPin, duty, duty, duty);
#else
  (void)duty;
#endif
}

void applyTestLedDutyToOutputs(uint8_t duty) {
  applyAuxTestLedDuty(duty);
  applyOnboardTestLedDuty(duty);
}

void applyTestLedState() {
  if (!isTestLedAvailable()) {
    return;
  }

  if (gTestLedUntilMs > 0) {
    applyTestLedDutyToOutputs(gTestLedState ? gTestLedPulseDuty : 0);
    return;
  }

  if (gAuxLedAvailable && gTestLedEnabled) {
    applyAuxTestLedDuty(gTestLedDuty);
  } else {
    applyAuxTestLedDuty(0);
  }

  applyOnboardTestLedDuty(0);
}

void updateTestLedDutyFromBrightness(uint8_t brightness) {
  if (!gAuxLedAvailable) {
    gTestLedDuty = 0;
  } else if (gTestLedDuty != brightness) {
    gTestLedDuty = brightness;
  }

  gTestLedPulseDuty = brightness;
  if (gTestLedUntilMs == 0) {
    applyTestLedState();
  }
}

void setMatrixBrightness(uint8_t brightness) {
  if (gAppliedBrightness == brightness) {
    return;
  }

#if defined(MICA_PROFILE_DMA_EXP)
  if (gMatrixReady && gMatrix != nullptr) {
    gMatrix->setBrightness8(brightness);
  }
#endif

  gAppliedBrightness = brightness;
}

void clearMatrix() {
  if (!gMatrixReady) {
    return;
  }

#if defined(MICA_PROFILE_DMA_EXP)
  if (gMatrix != nullptr) {
    gMatrix->clearScreen();
    clearMatrixShadowBuffer(gMatrixShadowBackBufferIndex);
  }
#endif
}

void drawMatrixPixel(uint8_t x, uint8_t y, const RgbColor& color) {

#if defined(MICA_PROFILE_DMA_EXP)
  if (gMatrix != nullptr) {
    gMatrix->drawPixelRGB888(x, y, color.r, color.g, color.b);
    setMatrixShadowPixel(x, y, rgb888ToRgb565(color.r, color.g, color.b));
  }
#endif
}

void fillMatrixRect(int16_t x, int16_t y, int16_t w, int16_t h, const RgbColor& color) {
  if (!gMatrixReady || w <= 0 || h <= 0) {
    return;
  }

  const int16_t xStart = x < 0 ? 0 : x;
  const int16_t yStart = y < 0 ? 0 : y;
  const int16_t xEnd = (x + w) > static_cast<int16_t>(kMatrixWidth) ? static_cast<int16_t>(kMatrixWidth) : static_cast<int16_t>(x + w);
  const int16_t yEnd = (y + h) > static_cast<int16_t>(kMatrixHeight) ? static_cast<int16_t>(kMatrixHeight) : static_cast<int16_t>(y + h);
  if (xStart >= xEnd || yStart >= yEnd) {
    return;
  }

#if defined(MICA_PROFILE_DMA_EXP)
  if (gMatrix != nullptr) {
    gMatrix->fillRect(
        xStart,
        yStart,
        xEnd - xStart,
        yEnd - yStart,
        rgb888ToRgb565(color.r, color.g, color.b));
    fillMatrixShadowRect(xStart, yStart, xEnd - xStart, yEnd - yStart, rgb888ToRgb565(color.r, color.g, color.b));
  }
#endif
}

bool commitMatrixFrame() {
#if defined(MICA_PROFILE_DMA_EXP)
  if (gMatrix != nullptr) {
    gMatrix->flipDMABuffer();
    gLastMatrixPresentUs = micros();
    gHub75PresentFrames++;
    gMatrixShadowBackBufferIndex ^= 1u;
    return true;
  }
#endif

  return false;
}

uint32_t getPhysicalPresentIntervalUs() {
#if defined(MICA_PROFILE_DMA_EXP)
  if (gMatrix != nullptr && gMatrix->calculated_refresh_rate > 0) {
    const uint32_t refreshRate = static_cast<uint32_t>(gMatrix->calculated_refresh_rate);
    const uint32_t intervalUs = ceilDivideU32(kMicrosPerSecond, refreshRate);
    return intervalUs == 0 ? 1u : intervalUs;
  }
#endif

  return kHub75FallbackPresentIntervalUs;
}

uint32_t getEffectiveMatrixPresentIntervalUs() {
  const uint32_t physicalPresentIntervalUs = getPhysicalPresentIntervalUs();
  return physicalPresentIntervalUs > kHub75TargetPresentIntervalUs
      ? physicalPresentIntervalUs
      : kHub75TargetPresentIntervalUs;
}

bool shouldPresentMatrixFrame(uint32_t nowUs) {
  return gLastMatrixPresentUs == 0
      || static_cast<uint32_t>(nowUs - gLastMatrixPresentUs) >= getEffectiveMatrixPresentIntervalUs();
}

void markMatrixFrameDirty(bool countAsAppliedFrame) {
  gMatrixFrameDirty = true;
  if (countAsAppliedFrame) {
    gPendingMatrixPresentCountsAsApplied = true;
  }
}

#if defined(MICA_PROFILE_DMA_EXP)
const char* hub75DriverName(HUB75_I2S_CFG::shift_driver driver) {
  switch (driver) {
    case HUB75_I2S_CFG::SHIFTREG:
      return "SHIFTREG";
    case HUB75_I2S_CFG::FM6124:
      return "FM6124";
    case HUB75_I2S_CFG::FM6126A:
      return "FM6126A";
    case HUB75_I2S_CFG::ICN2038S:
      return "ICN2038S";
    case HUB75_I2S_CFG::MBI5124:
      return "MBI5124";
    default:
      return "UNKNOWN";
  }
}
#endif

bool validateMatrixPinConfiguration() {
  if (kMatrixHeight < 64) {
    return true;
  }

  const int ePin = static_cast<int>(kMatrixAddrPins[4]);
  if (ePin < 0) {
    Serial.println("Pinout HUB75 invalido: painel 128x64 exige linha E.");
    return false;
  }

  if (ePin == static_cast<int>(kMatrixClockPin)
      || ePin == static_cast<int>(kMatrixLatchPin)
      || ePin == static_cast<int>(kMatrixOePin)) {
    Serial.printf(
        "Pinout HUB75 invalido: linha E=%d conflita com CLK/LAT/OE.\n",
        ePin);
    return false;
  }

  return true;
}

void logMatrixPinout() {
  Serial.printf(
      "HUB75 pinout RGB={%u,%u,%u,%u,%u,%u} ADDR={%u,%u,%u,%u,%u} LAT=%u OE=%u CLK=%u\n",
      static_cast<unsigned>(kMatrixRgbPins[0]),
      static_cast<unsigned>(kMatrixRgbPins[1]),
      static_cast<unsigned>(kMatrixRgbPins[2]),
      static_cast<unsigned>(kMatrixRgbPins[3]),
      static_cast<unsigned>(kMatrixRgbPins[4]),
      static_cast<unsigned>(kMatrixRgbPins[5]),
      static_cast<unsigned>(kMatrixAddrPins[0]),
      static_cast<unsigned>(kMatrixAddrPins[1]),
      static_cast<unsigned>(kMatrixAddrPins[2]),
      static_cast<unsigned>(kMatrixAddrPins[3]),
      static_cast<unsigned>(kMatrixAddrPins[4]),
      static_cast<unsigned>(kMatrixLatchPin),
      static_cast<unsigned>(kMatrixOePin),
      static_cast<unsigned>(kMatrixClockPin));
}

// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#pontos-de-alteracao-frequente
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#atualizacao-2026-03---hub75-128x64-single-canvas-mapping
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#atualizacao-2026-03---hub75-anti-flicker-com-double-buffer
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#atualizacao-2026-03---hub75-upstream-baseline-fluidity-recovery
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#atualizacao-2026-03---hub75-60-fps-com-pacing-fisico-correto
bool initMatrixDisplay() {

