eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
  uint8_t shaBytes[32];
  if (mbedtls_sha256_finish_ret(&shaContext, shaBytes) != 0) {
    Update.abort();
    mbedtls_sha256_free(&shaContext);
    errorCode = "firmware_sha_finish_failed";
    errorMessage = "Falha ao finalizar hash SHA-256 da OTA.";
    return false;
  }

  mbedtls_sha256_free(&shaContext);
  const String computedSha256 = bytesToLowerHex(shaBytes, sizeof(shaBytes));
  if (!computedSha256.equalsIgnoreCase(info.sha256)) {
    Update.abort();
    errorCode = "firmware_sha_mismatch";
    errorMessage = "Hash SHA-256 divergente no firmware baixado.";
    return false;
  }

  sendCommandProgress(commandId, 92, "flashing", "Validando e finalizando imagem OTA...");
  if (!Update.end()) {
    errorCode = "ota_end_failed";
    errorMessage = String("Falha ao finalizar OTA. code=") + Update.getError();
    return false;
  }

  if (!Update.isFinished()) {
    errorCode = "ota_incomplete";
    errorMessage = "OTA finalizada sem imagem completa.";
    return false;
  }

  return true;
}

void normalizeMqttConfig() {
  if (gMqttHost.isEmpty()) {
    gMqttHost = gServerHost;
  }

  if (gMqttPort == 0) {
    gMqttPort = kDefaultMqttPort;
  }

  if (gMqttRootTopic.isEmpty()) {
    gMqttRootTopic = kDefaultMqttRootTopic;
  }
}

void persistMqttConfig() {
  normalizeMqttConfig();
  gPrefs.putString("mqttHost", gMqttHost);
  gPrefs.putString("mqttPort", String(gMqttPort));
  gPrefs.putString("mqttRootTopic", gMqttRootTopic);
}

String buildDeviceMqttTopic(const char* suffix) {
  normalizeMqttConfig();
  return gMqttRootTopic + "/" + gDeviceId + "/" + String(suffix == nullptr ? "" : suffix);
}

bool publishMqttDocument(const String& topic, JsonDocument& doc, bool retained) {
  if (!gMqtt.connected()) {
    return false;
  }

  String payload;
  serializeJson(doc, payload);
  return gMqtt.publish(topic.c_str(), payload.c_str(), retained);
}

bool publishDeviceStats() {
  if (!gMqtt.connected() || gDeviceId.isEmpty()) {
    return false;
  }

  JsonDocument stats;
  stats["deviceId"] = gDeviceId;
  stats["chipModel"] = ESP.getChipModel();
  stats["chipRevision"] = ESP.getChipRevision();
  stats["chipCores"] = ESP.getChipCores();
  stats["cpuFreqMHz"] = ESP.getCpuFreqMHz();
  stats["sdkVersion"] = ESP.getSdkVersion();
  stats["heapTotalBytes"] = ESP.getHeapSize();
  stats["psramTotalBytes"] = ESP.getPsramSize();
  stats["flashTotalBytes"] = ESP.getFlashChipSize();
  stats["sketchSizeBytes"] = ESP.getSketchSize();
  stats["freeSketchBytes"] = ESP.getFreeSketchSpace();
  return publishMqttDocument(buildDeviceMqttTopic("stats"), stats, true);
}

bool publishDeviceLog(
    const char* level,
    const char* category,
    const char* eventCode,
    const String& message,
    bool includeTelemetrySequence) {
  if (!gMqtt.connected() || gDeviceId.isEmpty()) {
    return false;
  }

  String normalizedMessage = message;
  normalizedMessage.trim();
  if (normalizedMessage.length() == 0) {
    return false;
  }

  JsonDocument log;
  log["deviceId"] = gDeviceId;
  log["sequence"] = ++gDeviceLogSequence;
  log["level"] = (level != nullptr && level[0] != '\0') ? level : "info";
  log["category"] = (category != nullptr && category[0] != '\0') ? category : "device";
  if (eventCode != nullptr && eventCode[0] != '\0') {
    log["eventCode"] = eventCode;
  }

  log["message"] = normalizedMessage;
  log["uptimeSeconds"] = millis() / 1000UL;
  if (includeTelemetrySequence && gTelemetrySequence > 0) {
    log["telemetrySequence"] = gTelemetrySequence;
  }

  return publishMqttDocument(buildDeviceMqttTopic("logs"), log, false);
}

String buildPresencePayload(const char* state) {
  JsonDocument presence;
  presence["deviceId"] = gDeviceId;
  presence["state"] = state == nullptr ? "offline" : state;

  String payload;
  serializeJson(presence, payload);
  return payload;
}

bool publishPresence(const char* state) {
  if (gDeviceId.isEmpty() || !gMqtt.connected()) {
    return false;
  }

  JsonDocument presence;
  presence["deviceId"] = gDeviceId;
  presence["state"] = state == nullptr ? "offline" : state;
  return publishMqttDocument(buildDeviceMqttTopic("presence"), presence, true);
}

void disconnectMqtt(bool publishOffline) {
  if (!gMqtt.connected()) {
    return;
  }

  if (publishOffline) {
    (void)publishDeviceLog("warning", "mqtt", "disconnect", "Controle MQTT desconectando.", false);
    (void)publishPresence("offline");
    delay(20);
  }

  gMqtt.disconnect();
  gLastTelemetryMs = 0;
  gMqttDisconnectedSinceMs = millis();
}

void sendCommandProgress(
    const String& commandId,
    uint8_t progressPercent,
    const char* stage,
    const String& message,
    int successFlag) {
  if (commandId.isEmpty() || !gMqtt.connected()) {
    return;
  }

  JsonDocument progress;
  progress["deviceId"] = gDeviceId;
  progress["commandId"] = commandId;
  progress["progressPercent"] = progressPercent;
  if (stage != nullptr && stage[0] != '\0') {
    progress["stage"] = stage;
  }
  if (message.length() > 0) {
    progress["message"] = message;
  }
  if (successFlag == 0 || successFlag == 1) {
    progress["success"] = successFlag == 1;
  }

  (void)publishMqttDocument(buildDeviceMqttTopic("command-events"), progress, false);
  if (successFlag == 0 || successFlag == 1 || progressPercent >= 100) {
    (void)publishDeviceLog(
        successFlag == 0 ? "error" : "info",
        "command",
        stage,
        message.length() > 0 ? message : "Atualizacao de comando concluida.");
  }
}

void postCommandAck(
    const String& commandId,
    bool success,
    const String& message,
    int progressPercent,
    const char* stage,
    const char* errorCode = nullptr) {
  if (commandId.isEmpty()) {
    return;
  }

  JsonDocument ack;
  ack["deviceId"] = gDeviceId;
  ack["commandId"] = commandId;
  ack["success"] = success;
  ack["message"] = message;
  ack["progressPercent"] = progressPercent;
  if (stage != nullptr && stage[0] != '\0') {
    ack["stage"] = stage;
  }
  if (errorCode != nullptr && errorCode[0] != '\0') {
    ack["errorCode"] = errorCode;
  }

  postJsonWithAuth("/api/v1/device/command-ack", ack);
}

