eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
#if defined(MALLOC_CAP_SPIRAM)
    uint32_t largestPsramBlockBytes = 0;
    if (trySanitizeLargestFreeBlock(freePsramBytes, heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM), largestPsramBlockBytes)) {
      telemetry["largestPsramBlockBytes"] = largestPsramBlockBytes;
    }
#endif
  }

  telemetry["firmwareVersion"] = kFirmwareVersion;
  telemetry["ipAddress"] = WiFi.localIP().toString();
  telemetry["boardModel"] = kBoardModel;
  telemetry["panelType"] = kPanelType;
  const float chipTemperatureCelsius = temperatureRead();
  if (!isnan(chipTemperatureCelsius) && isfinite(chipTemperatureCelsius)) {
    telemetry["chipTemperatureCelsius"] = chipTemperatureCelsius;
  }
  if (gActiveAppId.length() > 0) {
    telemetry["activeAppId"] = gActiveAppId;
  }
  if (gActiveAppName.length() > 0) {
    telemetry["activeAppName"] = gActiveAppName;
  }

  (void)publishMqttDocument(buildDeviceMqttTopic("status"), telemetry, true);
}

void registerInvalidStreamFrame(const char* reason) {
  gStreamInvalidFrameCount++;
  if (gStreamInvalidFrameCount == 1 || (gStreamInvalidFrameCount % 25u) == 0u) {
    (void)publishDeviceLog(
        "warning",
        "stream",
        reason,
        String("Frame de stream invalido detectado. total=") + gStreamInvalidFrameCount);
  }
}

void clearTestLed() {
  if (!isTestLedAvailable()) {
    return;
  }

  gTestLedState = false;
  gTestLedUntilMs = 0;
  gTestLedNextToggleMs = 0;
  applyTestLedState();
}

void triggerTestLed() {
  if (!isTestLedAvailable()) {
    return;
  }

  gTestLedState = false;
  gTestLedPulseDuty = resolveAppliedBrightness();
  gTestLedUntilMs = millis() + kTestLedDurationMs;
  gTestLedNextToggleMs = 0;
  applyTestLedState();
}

void updateTestLed() {
  if (!isTestLedAvailable() || gTestLedUntilMs == 0) {
    return;
  }

  unsigned long now = millis();
  if (now >= gTestLedUntilMs) {
    clearTestLed();
    return;
  }

  if (gTestLedNextToggleMs == 0 || now >= gTestLedNextToggleMs) {
    gTestLedState = !gTestLedState;
    applyTestLedState();
    gTestLedNextToggleMs = now + kTestLedTogglePeriodMs;
  }
}

bool tryParseBooleanParameter(JsonVariantConst value, bool& output) {
  if (value.isNull()) {
    return false;
  }

  if (value.is<bool>()) {
    output = value.as<bool>();
    return true;
  }

  if (value.is<int>()) {
    output = value.as<int>() != 0;
    return true;
  }

  String raw = value.as<String>();
  raw.trim();
  raw.toLowerCase();
  if (raw == "1" || raw == "true" || raw == "on" || raw == "enabled") {
    output = true;
    return true;
  }

  if (raw == "0" || raw == "false" || raw == "off" || raw == "disabled") {
    output = false;
    return true;
  }

  return false;
}

void sendSerialJson(JsonDocument& document) {
  String payload;
  serializeJson(document, payload);
  Serial.println(payload);
}

void sendSerialHello() {
  JsonDocument hello;
  hello["type"] = "hello";
  hello["protocol"] = kSerialProvisioningProtocol;
  hello["deviceId"] = gDeviceId;
  hello["firmwareVersion"] = kFirmwareVersion;
  JsonArray caps = hello["capabilities"].to<JsonArray>();
  caps.add("provision");
  sendSerialJson(hello);
}

void sendSerialProgress(const String& requestId, const char* stage, const char* message) {
  if (requestId.length() == 0) {
    return;
  }

  JsonDocument progress;
  progress["type"] = "progress";
  progress["requestId"] = requestId;
  progress["stage"] = stage;
  progress["message"] = message;
  sendSerialJson(progress);
}

void sendSerialResult(
    const String& requestId,
    bool ok,
    const String& message,
    const char* errorCode = nullptr) {
  if (requestId.length() == 0) {
    return;
  }

  JsonDocument result;
  result["type"] = "result";
  result["requestId"] = requestId;
  result["ok"] = ok;
  result["message"] = message;
  if (errorCode != nullptr && errorCode[0] != '\0') {
    result["errorCode"] = errorCode;
  }

  if (!gDeviceId.isEmpty()) {
    result["deviceId"] = gDeviceId;
  }

  sendSerialJson(result);
}

bool tryParseServerBaseUrl(const String& rawBaseUrl, String& host, uint16_t& port) {
  String normalized = rawBaseUrl;
  normalized.trim();
  if (normalized.length() == 0) {
    return false;
  }

  if (normalized.startsWith("http://")) {
    normalized = normalized.substring(7);
  } else if (normalized.startsWith("https://")) {
    normalized = normalized.substring(8);
  }

  int slashIndex = normalized.indexOf('/');
  if (slashIndex >= 0) {
    normalized = normalized.substring(0, slashIndex);
  }

  int colonIndex = normalized.lastIndexOf(':');
  if (colonIndex >= 0) {
    host = normalized.substring(0, colonIndex);
    String portRaw = normalized.substring(colonIndex + 1);
    int parsedPort = portRaw.toInt();
    if (parsedPort <= 0 || parsedPort > 65535) {
      return false;
    }

    port = static_cast<uint16_t>(parsedPort);
    return host.length() > 0;
  }

  host = normalized;
  port = 5272;
  return host.length() > 0;
}

String buildServerBaseUrl(const String& host, uint16_t port) {
  if (host.length() == 0) {
    return "";
  }

  const uint16_t resolvedPort = port == 0 ? 5272 : port;
  return "http://" + host + ":" + String(resolvedPort);
}

bool tryApplyProvisioningPortalServer(
    const String& rawServerBaseUrl,
    const String& savedHost,
    uint16_t savedPort,
    String& errorCode,
    String& errorMessage) {
  String normalizedServerBaseUrl = rawServerBaseUrl;
  normalizedServerBaseUrl.trim();

  if (normalizedServerBaseUrl.length() == 0) {
    if (savedHost.length() > 0 && savedPort != 0) {
      gServerHost = savedHost;
      gServerPort = savedPort;
      gMqttHost = gServerHost;
      gMqttPort = kDefaultMqttPort;
      gMqttRootTopic = kDefaultMqttRootTopic;
      persistMqttConfig();
      setConnectivityState(kWifiStateConnected, "portal_server_empty_kept_saved", true);
      Serial.printf("[provisioning] campo Servidor vazio; mantendo configuracao salva %s.\n",
          buildServerBaseUrl(gServerHost, gServerPort).c_str());
      return true;
    }

    errorCode = "portal_server_missing";
    errorMessage = "Campo Servidor vazio e sem configuracao salva.";
    setConnectivityState(kWifiStateConnected, "portal_server_missing", true);
    Serial.println("[provisioning] campo Servidor vazio e sem configuracao salva.");
    return false;
  }

  String parsedHost;
  uint16_t parsedPort = 0;
  if (!tryParseServerBaseUrl(normalizedServerBaseUrl, parsedHost, parsedPort)) {
    if (savedHost.length() > 0 && savedPort != 0) {
      gServerHost = savedHost;
      gServerPort = savedPort;
      gMqttHost = gServerHost;
      gMqttPort = kDefaultMqttPort;
      gMqttRootTopic = kDefaultMqttRootTopic;
      persistMqttConfig();
      errorCode = "portal_server_invalid_kept_saved";
      errorMessage = "Campo Servidor invalido; mantendo configuracao salva.";
      setConnectivityState(kWifiStateConnected, "portal_server_invalid_kept_saved", true);
      Serial.printf("[provisioning] campo Servidor invalido '%s'; mantendo configuracao salva %s.\n",
          normalizedServerBaseUrl.c_str(),
          buildServerBaseUrl(gServerHost, gServerPort).c_str());
      return true;
    }

