eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
    sendCommandProgress(commandId, 100, "set-brightness", "Brilho atualizado.", 1);
    return;
  }

  if (strcmp(command, "update_firmware") == 0) {
    String requestedVersion = parameters["version"] | "";
    FirmwareReleaseInfo releaseInfo;
    String errorCode;
    String errorMessage;

    sendCommandProgress(commandId, 20, "received", "Comando recebido.");
    if (isRunningAppPendingVerify()) {
      errorCode = "ota_invalid_state_pending_verify";
      errorMessage = "A imagem atual ainda nao foi validada pelo safe update mode; conclua ou aguarde o primeiro boot antes de nova OTA.";
      (void)publishDeviceLog("warning", "command", errorCode.c_str(), errorMessage);
      sendCommandProgress(commandId, 100, "failed", errorMessage, 0);
      return;
    }

    if (!tryFetchLatestFirmwareRelease(releaseInfo, requestedVersion, errorCode, errorMessage)) {
      (void)publishDeviceLog("warning", "command", errorCode.c_str(), errorMessage);
      sendCommandProgress(commandId, 100, "failed", errorMessage, 0);
      return;
    }

    if (!performFirmwareOta(releaseInfo, commandId, errorCode, errorMessage)) {
      (void)publishDeviceLog("warning", "command", errorCode.c_str(), errorMessage);
      sendCommandProgress(commandId, 100, "failed", errorMessage, 0);
      return;
    }

    if (!persistPendingOtaContext(commandId, kFirmwareVersion, releaseInfo.firmwareVersion)) {
      errorCode = "ota_context_persist_failed";
      errorMessage = "Firmware baixado, mas nao foi possivel registrar o contexto do safe update mode antes do reboot.";
      (void)publishDeviceLog("warning", "command", errorCode.c_str(), errorMessage);
      sendCommandProgress(commandId, 100, "failed", errorMessage, 0);
      return;
    }

    sendCommandProgress(commandId, 94, "rebooting", "Firmware aplicado. Reiniciando para validacao segura.");
    (void)publishPresence("offline");
    delay(250);
    ESP.restart();
    return;
  }

  if (strcmp(command, "install_app") == 0) {
    String appId = parameters["appId"] | "";
    String appName = parameters["displayName"] | "";
    String configJson = parameters["configJson"] | "";

    sendCommandProgress(commandId, 20, "received", "Comando recebido.");
    if (appId.length() == 0) {
      (void)publishDeviceLog("warning", "command", "install_app_missing_appid", "appId ausente para install_app.");
      sendCommandProgress(commandId, 100, "invalid", "appId ausente.", 0);
      return;
    }

    sendCommandProgress(commandId, 70, "install-app", "Salvando app...");
    gActiveAppId = appId;
    gActiveAppName = appName.length() > 0 ? appName : appId;
    gActiveAppConfig = configJson;
    gPrefs.putString("activeAppId", gActiveAppId);
    gPrefs.putString("activeAppName", gActiveAppName);
    gPrefs.putString("activeAppConfig", gActiveAppConfig);
    sendTelemetry(true);

    sendCommandProgress(commandId, 100, "install-app", "App instalado.", 1);
    return;
  }

  if (strcmp(command, "activate_app") == 0) {
    String appId = parameters["appId"] | "";
    String appName = parameters["displayName"] | "";

    sendCommandProgress(commandId, 20, "received", "Comando recebido.");
    if (appId.length() == 0) {
      (void)publishDeviceLog("warning", "command", "activate_app_missing_appid", "appId ausente para activate_app.");
      sendCommandProgress(commandId, 100, "invalid", "appId ausente.", 0);
      return;
    }

    gActiveAppId = appId;
    gActiveAppName = appName.length() > 0 ? appName : appId;
    gPrefs.putString("activeAppId", gActiveAppId);
    gPrefs.putString("activeAppName", gActiveAppName);
    sendTelemetry(true);

    sendCommandProgress(commandId, 100, "activate-app", "App ativado.", 1);
    return;
  }

  if (strcmp(command, "set_app_config") == 0) {
    String appId = parameters["appId"] | "";
    String configJson = parameters["configJson"] | "";

    sendCommandProgress(commandId, 20, "received", "Comando recebido.");
    if (appId.length() == 0) {
      (void)publishDeviceLog("warning", "command", "set_app_config_missing_appid", "appId ausente para set_app_config.");
      sendCommandProgress(commandId, 100, "invalid", "appId ausente.", 0);
      return;
    }

    gActiveAppId = appId;
    gActiveAppConfig = configJson;
    gPrefs.putString("activeAppId", gActiveAppId);
    gPrefs.putString("activeAppConfig", gActiveAppConfig);
    sendTelemetry(true);

    sendCommandProgress(commandId, 100, "set-app-config", "Configuracao aplicada.", 1);
    return;
  }

  (void)publishDeviceLog("warning", "command", "unknown_command", String("Comando desconhecido: ") + command);
  sendCommandProgress(commandId, 100, "unknown", "Comando desconhecido.", 0);
}

void onMqttMessage(char* topic, uint8_t* payload, unsigned int length) {
  if (topic == nullptr || payload == nullptr || length == 0 || gDeviceId.isEmpty()) {
    return;
  }

  String expectedTopic = buildDeviceMqttTopic("commands");
  if (!expectedTopic.equals(topic)) {
    return;
  }

  JsonDocument control;
  if (deserializeJson(control, payload, length) != DeserializationError::Ok) {
    return;
  }

  handleControlCommandMessage(control);
}

// DOCS: docs/wiki/guides/operate-device-lifecycle.md#passos
void onWsEvent(WStype_t type, uint8_t *payload, size_t len) {
  if (type == WStype_CONNECTED) {
    gWsDisconnectedSinceMs = 0;
    registerWsConnectivitySample(true);
    setConnectivityState(kWifiStateConnected, "ws_connected", true, false);
    Serial.println("[ws_connected] sessao websocket estabelecida.");
    sendTelemetry(true);
    return;
  }

  if (type == WStype_DISCONNECTED) {
    registerWsConnectivitySample(false);
    setConnectivityState(WiFi.status() == WL_CONNECTED ? kWifiStateConnected : kWifiStateDisconnected, "ws_disconnected", true, false);
    Serial.println("[ws_disconnected] sessao websocket encerrada.");
    gLastTelemetryMs = 0;
    return;
  }

  if (type == WStype_BIN) {
    if (payload == nullptr || len < 2) {
      registerInvalidStreamFrame("payload_short");
      return;
    }

    if (payload[0] != kStreamVersion) {
      registerInvalidStreamFrame("version_invalid");
      return;
    }

