eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
    uint32_t frameSequence = 0;
    const bool hasSequence = len >= 6;
    if (hasSequence) {
      frameSequence = static_cast<uint32_t>(payload[2]) |
                      (static_cast<uint32_t>(payload[3]) << 8) |
                      (static_cast<uint32_t>(payload[4]) << 16) |
                      (static_cast<uint32_t>(payload[5]) << 24);
    }

    const uint8_t messageType = payload[1];
    if (messageType == kStreamBinsMessageType) {
      if (len < kStreamFrameSize) {
        registerInvalidStreamFrame("bins_short");
        return;
      }

      gStreamFramesReceived++;
      if (hasSequence) {
        if (gHasStreamLastSequence && frameSequence > gStreamLastSequence + 1u) {
          gStreamSequenceGapCount += frameSequence - (gStreamLastSequence + 1u);
        }

        gStreamLastSequence = frameSequence;
        gHasStreamLastSequence = true;
      }

      const uint8_t nextBinsIndex = static_cast<uint8_t>(gBinsActiveIndex ^ 1u);
      portENTER_CRITICAL(&gStreamBufferMux);
      gLevel = payload[14];
      memcpy(gBinsBuffers[nextBinsIndex], payload + 15, kBinsCount);
      gBinsActiveIndex = nextBinsIndex;
      gStreamBrightness = payload[143];
      portEXIT_CRITICAL(&gStreamBufferMux);
      gFrameModeActive = false;
      gLastFrameMs = millis();
      gMatrixSignalTimedOut = false;
      markMatrixFrameDirty(true);
      return;
    }

    if (messageType == kStreamFrame128x64Rgb565MessageType) {
      if (len < kStreamFrame128x64Rgb565Size) {
        registerInvalidStreamFrame("frame_short");
        return;
      }

      gStreamFramesReceived++;
      if (hasSequence) {
        if (gHasStreamLastSequence && frameSequence > gStreamLastSequence + 1u) {
          gStreamSequenceGapCount += frameSequence - (gStreamLastSequence + 1u);
        }

        gStreamLastSequence = frameSequence;
        gHasStreamLastSequence = true;
      }

      const uint8_t nextFrameIndex = static_cast<uint8_t>(gFrameRgb565ActiveIndex ^ 1u);
      uint16_t* frameBackBuffer = gFrameRgb565Buffers[nextFrameIndex];
      gStreamBrightness = payload[14];
      // Payload is already little-endian and ESP32 is little-endian, so we can bulk copy.
      memcpy(frameBackBuffer, payload + 15, static_cast<size_t>(kMatrixPixelCount) * sizeof(uint16_t));

      portENTER_CRITICAL(&gStreamBufferMux);
      gFrameRgb565ActiveIndex = nextFrameIndex;
      portEXIT_CRITICAL(&gStreamBufferMux);

      gFrameModeActive = true;
      gLastFrameMs = millis();
      gMatrixSignalTimedOut = false;
      markMatrixFrameDirty(true);
      return;
    }

    registerInvalidStreamFrame("message_type_unknown");

    return;
  }

  if (type != WStype_TEXT || payload == nullptr || len == 0) {
    return;
  }

  JsonDocument control;
  if (deserializeJson(control, payload, len) != DeserializationError::Ok) {
    return;
  }
  handleControlCommandMessage(control);
}

void connectWebSocket() {
  if (gDeviceId.isEmpty() || gToken.isEmpty() || gServerHost.isEmpty()) {
    setConnectivityState(kWifiStateConnecting, "ws_missing_auth", true, false);
    return;
  }

  if (WiFi.status() != WL_CONNECTED) {
    setConnectivityState(kWifiStateConnecting, "ws_waiting_wifi", true, false);
    return;
  }

  String extraHeaders = "X-Device-Id: " + gDeviceId + "\r\nX-Device-Token: " + gToken;
  gWs.setExtraHeaders(extraHeaders.c_str());
  String path = "/ws/v1/stream";
  Serial.printf("[ws] conectando em ws://%s:%u%s\n", gServerHost.c_str(), gServerPort, path.c_str());
  setConnectivityState(kWifiStateConnected, "ws_connecting", true, false);
  gWs.begin(gServerHost.c_str(), gServerPort, path.c_str());
  gWs.onEvent(onWsEvent);
  gWs.setReconnectInterval(kWsAutoReconnectIntervalMs);
}

void connectMqtt() {
  normalizeMqttConfig();
  if (gDeviceId.isEmpty() || gToken.isEmpty() || gMqttHost.isEmpty()) {
    return;
  }

  if (WiFi.status() != WL_CONNECTED) {
    return;
  }

  if (gMqtt.connected()) {
    return;
  }

  gMqtt.setServer(gMqttHost.c_str(), gMqttPort);
  gMqtt.setCallback(onMqttMessage);
  gMqtt.setBufferSize(kMqttPacketBufferBytes);

  String presenceTopic = buildDeviceMqttTopic("presence");
  String offlinePayload = buildPresencePayload("offline");
  Serial.printf("[mqtt] conectando em mqtt://%s:%u (%s)\n", gMqttHost.c_str(), gMqttPort, gMqttRootTopic.c_str());

  const bool connected = gMqtt.connect(
      gDeviceId.c_str(),
      gDeviceId.c_str(),
      gToken.c_str(),
      presenceTopic.c_str(),
      1,
      true,
      offlinePayload.c_str());

  if (!connected) {
    gMqttDisconnectedSinceMs = millis();
    return;
  }

  gMqttDisconnectedSinceMs = 0;
  (void)gMqtt.subscribe(buildDeviceMqttTopic("commands").c_str(), 1);
  (void)publishPresence("online");
  (void)publishDeviceLog("info", "mqtt", "connected", "Controle MQTT conectado.", false);
  (void)publishDeviceStats();
  sendTelemetry(true);
  publishPendingOtaReportIfNeeded();
}

// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#fluxo-de-execucao
bool drawBars() {
  if (!gMatrixReady) {
    return false;
  }

  uint8_t binsSnapshot[kBinsCount];
  uint8_t levelSnapshot = 0;
  uint8_t streamBrightnessSnapshot = 0;
  {
    portENTER_CRITICAL(&gStreamBufferMux);
    const uint8_t index = gBinsActiveIndex;
    memcpy(binsSnapshot, gBinsBuffers[index], sizeof(binsSnapshot));
    levelSnapshot = gLevel;
    streamBrightnessSnapshot = gStreamBrightness;
    portEXIT_CRITICAL(&gStreamBufferMux);
  }

  const uint8_t bufferIndex = gMatrixShadowBackBufferIndex;
  uint8_t* renderedHeights = gMatrixShadowBarHeights[bufferIndex];
  if (gMatrixBufferModes[bufferIndex] != MatrixBufferMode::Bars) {
    clearMatrix();
    memset(renderedHeights, 0, sizeof(gMatrixShadowBarHeights[bufferIndex]));
  }

  const uint16_t columnCount = (kBinsCount < kMatrixWidth) ? kBinsCount : kMatrixWidth;
  for (uint16_t x = 0; x < kMatrixWidth; x++) {
    uint8_t targetHeight = 0;
    RgbColor targetColor = {0, 0, 0};
    if (x < columnCount) {
      const uint16_t binIndex = (x * kBinsCount) / columnCount;
      const uint8_t amplitude = binsSnapshot[binIndex];
      targetHeight =
          static_cast<uint8_t>((static_cast<uint16_t>(amplitude) * kMatrixHalfHeight + 254u) / 255u);
      targetColor = rainbowColorForColumn(x, columnCount);
    }

    const uint8_t previousHeight = renderedHeights[x];
    if (targetHeight > previousHeight) {
      const uint8_t deltaHeight = static_cast<uint8_t>(targetHeight - previousHeight);
      fillMatrixRect(
          static_cast<int16_t>(x),
          static_cast<int16_t>(kMatrixHalfHeight - targetHeight),
          1,
          deltaHeight,
          targetColor);
      fillMatrixRect(
          static_cast<int16_t>(x),
          static_cast<int16_t>(kMatrixHalfHeight + previousHeight),
          1,
          deltaHeight,
          targetColor);
    } else if (targetHeight < previousHeight) {
      const uint8_t deltaHeight = static_cast<uint8_t>(previousHeight - targetHeight);
      const RgbColor black = {0, 0, 0};
      fillMatrixRect(
          static_cast<int16_t>(x),
          static_cast<int16_t>(kMatrixHalfHeight - previousHeight),
          1,
          deltaHeight,
          black);
      fillMatrixRect(
          static_cast<int16_t>(x),
          static_cast<int16_t>(kMatrixHalfHeight + targetHeight),
          1,
          deltaHeight,
          black);
    }

