eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
    renderedHeights[x] = targetHeight;
  }

  gMatrixBufferModes[bufferIndex] = MatrixBufferMode::Bars;
  return commitMatrixFrame();
}

bool drawFrame128x64() {
  if (!gMatrixReady) {
    return false;
  }

  const uint8_t bufferIndex = gMatrixShadowBackBufferIndex;
  const uint8_t frameIndex = gFrameRgb565ActiveIndex;
  const uint16_t* frame = gFrameRgb565Buffers[frameIndex];
  // Bulk RGB565 path writes the full frame directly into the HUB75 BCM back buffer.
  gMatrix->writeFrameRGB565(frame);
  memcpy(gMatrixShadowFrames[bufferIndex], frame, sizeof(gFrameRgb565Buffers[0]));
  memset(gMatrixShadowBarHeights[bufferIndex], 0, sizeof(gMatrixShadowBarHeights[bufferIndex]));
  gMatrixBufferModes[bufferIndex] = MatrixBufferMode::Frame;
  return commitMatrixFrame();
}
}  // namespace

void setup() {
  Serial.begin(115200);
  Serial.println("[boot] inicializando firmware.");
  Serial.printf(
      "[ws] max_data_size=%u frame128x64_payload=%u\n",
      static_cast<unsigned>(WEBSOCKETS_MAX_DATA_SIZE),
      static_cast<unsigned>(kStreamFrame128x64Rgb565Size));
  if (strcmp(kSecurityProfile, "dev") == 0) {
    Serial.printf("MicaAudio firmware board=%s profile=%s security=%s\\n", kBoardModel, kFirmwareProfile, kSecurityProfile);
  }

  gPrefs.begin("micaaudio", false);
  Serial.println("[wifi_connecting] preparando conectividade.");
  setConnectivityState(kWifiStateConnecting, "boot", true);

  gBrightnessCap = clampBrightnessToSafeRange(static_cast<int>(gPrefs.getUChar("brightnessCap", kBrightnessDefaultCap)));
  gTestLedEnabled = gPrefs.getBool("testLedEnabled", false);
  gStreamBrightness = gBrightnessCap;
  gAppliedBrightness = resolveAppliedBrightness();
  initializeColorConversionLookups();
  resetMatrixShadowState();
  initializeOnboardTestLed();
  initializeAuxLed();

  if (!initMatrixDisplay()) {
    Serial.println("Painel HUB75 indisponivel: exibicao de barras desativada.");
  }

  updateTestLedDutyFromBrightness(resolveAppliedBrightness());
  applyTestLedState();

  gServerHost = gPrefs.getString("host", "");
  gServerPort = static_cast<uint16_t>(atoi(gPrefs.getString("port", "5272").c_str()));
  gMqttHost = gPrefs.getString("mqttHost", "");
  gMqttPort = static_cast<uint16_t>(atoi(gPrefs.getString("mqttPort", "5273").c_str()));
  gMqttRootTopic = gPrefs.getString("mqttRootTopic", kDefaultMqttRootTopic);
  normalizeMqttConfig();
  gDeviceId = gPrefs.getString("deviceId", "");
  gToken = gPrefs.getString("token", "");
  gActiveAppId = gPrefs.getString("activeAppId", "");
  gActiveAppName = gPrefs.getString("activeAppName", "");
  gActiveAppConfig = gPrefs.getString("activeAppConfig", "");
  loadPendingOtaContext();
  initializePendingOtaBootState();

  const bool missingServerConfig = gServerHost.isEmpty() || gServerPort == 0;
  const bool missingDeviceCredentials = gDeviceId.isEmpty() || gToken.isEmpty();
  if (missingServerConfig || missingDeviceCredentials) {
    const char* bootReason = missingServerConfig
        ? "boot_missing_server_config"
        : "boot_missing_device_credentials";
    Serial.printf("[boot] configuracao incompleta; abrindo provisioning portal (%s).\n", bootReason);
    (void)startProvisioningPortal(bootReason);

    gServerHost = gPrefs.getString("host", "");
    gServerPort = static_cast<uint16_t>(atoi(gPrefs.getString("port", "5272").c_str()));
    gMqttHost = gPrefs.getString("mqttHost", "");
    gMqttPort = static_cast<uint16_t>(atoi(gPrefs.getString("mqttPort", "5273").c_str()));
    gMqttRootTopic = gPrefs.getString("mqttRootTopic", kDefaultMqttRootTopic);
    normalizeMqttConfig();
    gDeviceId = gPrefs.getString("deviceId", "");
    gToken = gPrefs.getString("token", "");
  }

  WiFi.mode(WIFI_STA);
  WiFi.begin();

  bool bootWifiConnected = false;
  if (!gServerHost.isEmpty() && gServerPort != 0) {
    unsigned long bootWifiWaitStart = millis();
    while (WiFi.status() != WL_CONNECTED && (millis() - bootWifiWaitStart) < 5000) {
      processSerialProvisioning();
      delay(120);
    }

    bootWifiConnected = WiFi.status() == WL_CONNECTED;
  }

  if (gServerHost.isEmpty() || gServerPort == 0 || gDeviceId.isEmpty() || gToken.isEmpty()) {
    Serial.println("[wifi_connecting] aguardando provisioning por AP para concluir configuracao.");
    setConnectivityState(kWifiStateDisconnected, "boot_missing_server_config", true);
    gWifiDisconnectedSinceMs = millis();
  } else if (bootWifiConnected) {
    Serial.println("[wifi_connected] Wi-Fi conectado no boot.");
    setConnectivityState(kWifiStateConnected, "wifi_connected", true);
    connectMqtt();
    connectWebSocket();
  } else {
    Serial.println("[wifi_connecting] sem Wi-Fi no boot, aguardando reconexao.");
    setConnectivityState(kWifiStateDisconnected, "boot_waiting_wifi", true);
    gWifiDisconnectedSinceMs = millis();
  }

  sendSerialHello();
}

void loop() {
  const uint32_t loopStartedUs = micros();
  processSerialProvisioning();
  processPendingOtaSafeUpdate();
  const uint32_t networkBudgetStartUs = micros();
  bool networkBudgetExhausted = false;
  auto shouldRunNetworkStep = [&](bool eligible) -> bool {
    if (!eligible) {
      return false;
    }

    if (networkBudgetExhausted) {
      gNetworkPollDeferCount++;
      return false;
    }

    return true;
  };
  auto finishNetworkStep = [&]() {
    if (elapsedMicrosSince(networkBudgetStartUs) >= kNetworkPollBudgetUs) {
      networkBudgetExhausted = true;
    }
  };

  const bool wifiConnected = WiFi.status() == WL_CONNECTED;
  if (!wifiConnected) {
    if (shouldRunNetworkStep(gWifiDisconnectedSinceMs == 0)) {
      gWifiDisconnectedSinceMs = millis();
      setConnectivityState(kWifiStateDisconnected, "wifi_disconnected", true);
      Serial.println("[wifi] desconectado, aguardando reconexao.");
      finishNetworkStep();
    }

    const bool shouldStartProvisioningFallback =
        !gProvisioningPortalActive
        && gWifiDisconnectedSinceMs != 0
        && (millis() - gWifiDisconnectedSinceMs) > kWifiDisconnectProvisioningFallbackMs;
    bool provisioningStarted = false;
    if (shouldRunNetworkStep(shouldStartProvisioningFallback)) {
      Serial.println("[wifi] fallback para provisioning apos queda prolongada.");
      (void)startProvisioningPortal("wifi_disconnected_fallback");
      gWifiDisconnectedSinceMs = 0;
      provisioningStarted = true;
      finishNetworkStep();
    }

    if (provisioningStarted) {
      if (shouldRunNetworkStep(true)) {
        connectMqtt();
        finishNetworkStep();
      }
      if (shouldRunNetworkStep(true)) {
        connectWebSocket();
        finishNetworkStep();
      }
    }
  } else {
    if (gWifiDisconnectedSinceMs != 0) {
      gWifiDisconnectedSinceMs = 0;
    }

    if (shouldRunNetworkStep(gProvisioningPortalActive)) {
      setProvisioningPortalActive(false, "portal_closed");
      finishNetworkStep();
    }

    if (shouldRunNetworkStep(true)) {
      setConnectivityState(kWifiStateConnected, "wifi_connected");
      finishNetworkStep();
    }
    if (shouldRunNetworkStep(true)) {
      gMqtt.loop();
      finishNetworkStep();
    }
    if (shouldRunNetworkStep(true)) {
      gWs.loop();
      finishNetworkStep();
    }
    if (shouldRunNetworkStep(true)) {
      flushWsFlapDiagnostics(false);
      finishNetworkStep();
    }

